In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1= {
    "name":['hary','arjun','ram','ritik'],
    "marks":[98,34,34,23],
    "city":["kathmandu","pokhara","dhading","hetauda"]
}

In [3]:
df = pd.DataFrame(dict1)

In [4]:
df

    name  marks       city
0   hary     98  kathmandu
1  arjun     34    pokhara
2    ram     34    dhading
3  ritik     23    hetauda

In [5]:
df.to_csv('friendindex.csv')

In [6]:
df.to_csv('friends.csv',index = False)

In [7]:
df.head(2)

    name  marks       city
0   hary     98  kathmandu
1  arjun     34    pokhara

In [8]:
df.tail(2)

    name  marks     city
2    ram     34  dhading
3  ritik     23  hetauda

In [9]:
df.describe()

         marks
count   4.0000
mean   47.2500
std    34.2284
min    23.0000
25%    31.2500
50%    34.0000
75%    50.0000
max    98.0000

In [10]:
arjun = pd.read_csv("arjun.csv")

In [11]:
arjun

   Unnamed: 0     name  roll no        city
0           0    arjun         1  kathmandu
1           1     ram          3    pokhara
2           2     hari         4    dhading
3           3  nirpesh         5    hetauda

In [12]:
ser = pd.Series(np.random.rand(34))

In [13]:
type(ser)

pandas.core.series.Series

In [14]:
ser

0     0.978185
1     0.124338
2     0.581285
3     0.886465
4     0.161793
5     0.792259
6     0.296646
7     0.654268
8     0.671999
9     0.541084
10    0.459863
11    0.931510
12    0.178301
13    0.519160
14    0.295373
15    0.942949
16    0.176729
17    0.454784
18    0.671858
19    0.327114
20    0.167281
21    0.895866
22    0.350276
23    0.699733
24    0.617210
25    0.496895
26    0.064976
27    0.317413
28    0.521246
29    0.613170
30    0.857757
31    0.379993
32    0.277180
33    0.044317
dtype: float64

In [15]:
newdf = pd.DataFrame(np.random.rand(334,5),index =np.arange(334))

In [16]:
newdf

            0         1         2         3         4
0    0.840657  0.262000  0.322648  0.496460  0.239799
1    0.391300  0.803922  0.248244  0.509155  0.490879
2    0.390498  0.739197  0.909612  0.145330  0.392688
3    0.537984  0.141248  0.139826  0.588200  0.536134
4    0.153436  0.731739  0.626022  0.848761  0.669403
..        ...       ...       ...       ...       ...
329  0.930298  0.807770  0.950211  0.655299  0.289971
330  0.694124  0.967449  0.015942  0.626446  0.015236
331  0.063903  0.645786  0.007187  0.862605  0.052344
332  0.252695  0.692599  0.649806  0.514493  0.509782
333  0.083230  0.604429  0.379274  0.312115  0.291520

[334 rows x 5 columns]

In [17]:
type(newdf)

pandas.core.frame.DataFrame

In [19]:
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [21]:
newdf.describe()

                0           1           2           3           4
count  334.000000  334.000000  334.000000  334.000000  334.000000
mean     0.506605    0.494251    0.500539    0.519836    0.532847
std      0.292803    0.284685    0.291948    0.280558    0.285375
min      0.004449    0.000700    0.006243    0.006536    0.002990
25%      0.249846    0.260160    0.246744    0.294919    0.292052
50%      0.517518    0.485400    0.490842    0.516673    0.537832
75%      0.758541    0.740247    0.756456    0.776822    0.771106
max      0.998356    0.998191    0.998950    0.999086    0.995310

In [23]:
newdf[0][0]="arjun"

In [25]:
newdf.head()

          0         1         2         3         4
0     arjun  0.262000  0.322648  0.496460  0.239799
1    0.3913  0.803922  0.248244  0.509155  0.490879
2  0.390498  0.739197  0.909612  0.145330  0.392688
3  0.537984  0.141248  0.139826  0.588200  0.536134
4  0.153436  0.731739  0.626022  0.848761  0.669403

In [28]:
newdf.to_numpy

<bound method DataFrame.to_numpy of             0         1         2         3         4
0       arjun  0.262000  0.322648  0.496460  0.239799
1      0.3913  0.803922  0.248244  0.509155  0.490879
2    0.390498  0.739197  0.909612  0.145330  0.392688
3    0.537984  0.141248  0.139826  0.588200  0.536134
4    0.153436  0.731739  0.626022  0.848761  0.669403
..        ...       ...       ...       ...       ...
329  0.930298  0.807770  0.950211  0.655299  0.289971
330  0.694124  0.967449  0.015942  0.626446  0.015236
331  0.063903  0.645786  0.007187  0.862605  0.052344
332  0.252695  0.692599  0.649806  0.514493  0.509782
333   0.08323  0.604429  0.379274  0.312115  0.291520

[334 rows x 5 columns]>